# ###################################################################################################################################################
# SETUP
# ###################################################################################################################################################

# Taps
tap 'colindean/fonts-nonfree'

# tap 'cantino/mcfly'
# tap 'homebrew/bundle'
# tap 'homebrew/core'
# tap 'homebrew/cask'
# tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'

cask_args appdir: '/Applications' # Définir où placer les applications installées
brew 'mas' # Permettre l'installation d'applications de l'AppStore
brew 'svn' # SVN pour installer les polices


# ###################################################################################################################################################
# Outils système et réseau
# ###################################################################################################################################################

brew 'openssh'
brew 'boring' ## SSH tunnel manager
brew 'ssh-copy-id'
brew 'openssl'
brew 'wget'
brew 'curl'
brew 'openvpn'
cask 'pritunl'
cask 'tunnelblick'

# brew 'havn' # port scanner
# cask 'Cyberduck'
# brew 'duck'
# cask 'ngrok'
# mas 'WireGuard', id: 1451685025
# brew 'rsync'
# cask 'airpass' # change mac address
# brew 'rclone'



# ###################################################################################################################################################
# Outils pour le terminal
# ###################################################################################################################################################

cask 'iterm2'
brew 'zsh-completions'
brew 'htop'
brew 'tmux'
brew 'pygments'
brew 'neovim'
brew 'ranger'
brew 'superfile' # launch with spf
brew 'fastfetch'
brew 'duf'
brew 'forgit'
brew 'tlrc'
brew 'bat'
brew 'diff-so-fancy'
brew 'hgrep'
brew 'rink'
brew 'dug' # dns propagation cli
brew 'dasel' # manipulate json files
brew 'lazyjournal'
brew 'gotz' # timezones
brew 'tldx' # check domain name availability
brew 'doxx' # a tester - afficher docx dans terminal
brew 'xleak' # a tester - afficher xlsx dans terminal
brew 'mac-cleanup-py' # a tester
brew 'mcat' # fancy cat

brew 'fd' ## find alternative
brew 'rich' ## cat alternative

# brew 'mcfly'
# brew 'asciinema'
# brew 'agg'
# brew 'vimtutor-sequel'
# brew 'logdy' # add | logdy after tail command
# brew 'numbat'
# brew 'autojump'



# ###################################################################################################################################################
# Utilitaires
# ###################################################################################################################################################

# Quicklook for files without extension (README, INSTALL, Rakefile, Makefile…)
cask 'glance-chamburr'

cask 'keka'
cask 'adobe-acrobat-reader'
cask 'alfred'
cask 'appcleaner'
cask 'domzilla-caffeine'
cask 'itsycal'
cask 'rectangle'
cask 'joplin'
cask 'obsidian'
cask 'onyx'
cask 'nextcloud'
cask 'monitorcontrol'
cask 'localsend'

brew 'goclone'

# cask 'pairpods'
# brew 'pipet' # web scraper cli
# brew 'batt' # Battery management
# brew 'rnr' # - Batch rename
# cask 'modern-csv'
# cask 'muzzle'
# cask 'barrier'
# cask 'balenaetcher'
# cask 'unetbootin'
# cask 'the-unarchiver'
# mas 'Trello', id: 1278508951



# ###################################################################################################################################################
# Outils de backup et synchro
# ###################################################################################################################################################

# cask 'timemachineeditor'
# brew 'borgbackup'
# cask 'vorta'
# brew 'restic' ## A TESTER
# brew 'borgmatic'



# ###################################################################################################################################################
# Navigateurs
# ###################################################################################################################################################

cask 'firefox'

# brew 'lynx'



# ###################################################################################################################################################
# Outils de développement
# ###################################################################################################################################################

brew 'git'
brew 'lazygit'
cask 'github'
cask 'sublime-text'
cask 'vscodium'
brew 'orbstack'
brew 'docker'
brew 'ddev/ddev/ddev'
brew 'nss' ## required for mkcert --install
brew 'htmlhint'

# cask 'meld'
# cask 'sourcetree'
# cask 'lazydocker'
# brew 'fzf'
# brew 'git-machete'  ## A TESTER



# ###################################################################################################################################################
# Static generators
# ###################################################################################################################################################

# brew 'hugo'
# brew 'eleventy'



# ###################################################################################################################################################
# Traitement d'image
# ###################################################################################################################################################

# brew 'graphicsmagick'
# brew 'gsl'
# brew 'exiftool'
# brew 'imagemagick'
# mas 'Boxy SVG', id: 611658502
# cask 'imageoptim'
# brew 'jhead'
# brew 'webp'



# ###################################################################################################################################################
# Multimédia
# ###################################################################################################################################################

cask 'qobuz'
cask 'vlc'
brew 'ffmpeg'
brew 'gifsicle'
brew 'obs'

# cask 'iina'
# cask 'jubler'
# cask 'handbrake'
# cask 'soda-player'
# cask 'vox'
# mas 'black-out', id: 1319884285
# cask 'caption'
# cask 'kap'
# brew 'ffmpeg', args: ['with-libvorbis', 'with-libvpx', 'with-openh264', 'with-theora', 'with-fdk-aac', 'with-opus', 'with-frei0r']
# cask 'licecap'



# ###################################################################################################################################################
# Communication
# ###################################################################################################################################################

cask 'whatsapp'
cask 'signal'
cask 'rocket-chat'
cask 'microsoft-teams'
cask 'mattermost'

# cask 'slack'
# cask 'microsoft-teams@classic'
# cask 'zoom'
# cask 'skype'
# mas 'LimeChat', id: 414030210
# cask 'jitsi-meet'
# cask 'webex-meetings'
# cask 'discord'



# ###################################################################################################################################################
# Bureautique
# ###################################################################################################################################################

cask 'libreoffice'
cask 'libreoffice-language-pack'
mas 'Numbers', id: 409203825
brew 'bagels'

# mas 'Keynote', id: 409183694
# mas 'Pages', id: 409201541
# cask 'deepl'
# brew 'tesseract'
# brew 'tesseract-lang'



# ###################################################################################################################################################
# Fonts
# ###################################################################################################################################################

cask 'font-fira-code'
cask 'font-microsoft-office'
cask 'font-source-sans-pro'
cask 'font-roboto'
cask 'font-open-sans'
cask 'font-libre-baskerville'
cask 'font-elstob'

# cask 'fontforge'



# ###################################################################################################################################################
# Accessibility
# ###################################################################################################################################################

cask 'colour-contrast-analyser'
cask 'sim-daltonism'



# ###################################################################################################################################################
# Securite
# ###################################################################################################################################################

cask 'bitwarden'
cask 'lulu'
cask 'keeper-password-manager'
cask 'private-internet-access'

# cask 'protonvpn'
# brew 'testssl'
# cask 'veracrypt'
# cask 'macpass'
# brew 'gpg2'



# ###################################################################################################################################################
# Design
# ###################################################################################################################################################

cask 'figma'
cask 'krita'
mas 'LittleIpsum', id: 405772121
cask 'icon-shelf'
cask 'xnconvert'

# mas 'Pixelmator', id: 407963104



# ###################################################################################################################################################
# SEO
# ###################################################################################################################################################

cask 'screaming-frog-seo-spider'



# ###################################################################################################################################################
# IA
# ###################################################################################################################################################

cask 'jan'
# brew 'ollama'
# cask 'ollama'

cask 'epicenter-whispering'
# cask 'handy' # alternative for the above




# ###################################################################################################################################################
# MISC & DRIVERS
# ###################################################################################################################################################

cask 'aerial'
cask 'battle-net'
cask 'senabluetoothdevicemanager'
cask 'wacom-tablet'

# cask 'mac-mouse-fix@2'



# ###################################################################################################################################################
# ###################################################################################################################################################
# ###################################################################################################################################################
# TO INSTALL MANUALLY
# ###################################################################################################################################################
# ###################################################################################################################################################
# ###################################################################################################################################################

# Google Chrome
# Jungle Disk
# WORK : Printer Canon iR-ADV C2020L/2030L
# WORK : Printer Brother MFC-9465CDN
