# Utiliser Homebrew bundle
# https://github.com/Homebrew/homebrew-bundle



# ###################################################################################################################################################
# Taps
# ###################################################################################################################################################

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'

# tap 'caskroom/cask'
# tap 'caskroom/fonts'
# tap 'caskroom/versions'
# tap 'caskroom/drivers'
tap 'colindean/fonts-nonfree'



# ###################################################################################################################################################
# Définir où placer les applications installées
# ###################################################################################################################################################

cask_args appdir: '/Applications'



# ###################################################################################################################################################
# Permettre l'installation d'applications de l'AppStore
# ###################################################################################################################################################

brew 'mas'



# ###################################################################################################################################################
# Outils système et réseau
# ###################################################################################################################################################

brew 'openssh'
brew 'ssh-copy-id'
brew 'openssl'
brew 'wget'
brew 'curl'
cask 'Cyberduck'
mas 'ForkLift', id: 412448059
cask 'ngrok'
brew 'openvpn'
mas 'WireGuard', id: 1451685025

# brew 'rsync'
# cask 'airpass'
# brew 'stormssh'
# brew 'stormssh-completion'



# ###################################################################################################################################################
# Outils pour le terminal
# ###################################################################################################################################################

cask 'iterm2'
brew 'autojump'
brew 'zsh'
brew 'zsh-completions'



# ###################################################################################################################################################
# Utilitaires
# ###################################################################################################################################################

# Quicklook for files without extension (README, INSTALL, Rakefile, Makefile…)
cask 'qlstephen'
cask 'webpquicklook'
cask 'qlcommonmark'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qladdict'
mas 'Glance', id: 1513574319
brew 'fzf'
brew 'htop'

cask 'the-unarchiver'
cask 'adobe-acrobat-reader'
cask 'alfred'
cask 'appcleaner'
cask 'caffeine'
cask 'itsycal'
cask 'macdown'
cask 'numi'
cask 'send-anywhere'
cask 'spectacle'
mas 'Pocket', id: 568494494
mas 'Trello', id: 1278508951
cask 'muzzle'
cask 'transmission'
cask 'joplin'
cask 'nextcloud'
cask 'onyx'
brew 'pandoc'
brew 'rclone'



# ###################################################################################################################################################
# Outils de backup et synchro
# ###################################################################################################################################################

brew 'borgbackup'
cask 'vorta'
cask 'timemachineeditor'

# brew 'borgmatic'
# brew 'mackup'


# ###################################################################################################################################################
# Navigateurs
# ###################################################################################################################################################

cask 'firefox'
brew 'lynx'

# cask 'firefox-developer-edition'



# ###################################################################################################################################################
# Outils de développement
# ###################################################################################################################################################

brew 'git'
brew 'lazygit'
cask 'sourcetree'
cask 'github'
cask 'sublime-text'
brew 'python3'
brew 'composer'
brew 'gandi.cli'
brew 'wp-cli'
cask 'poedit'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'docker'
cask 'responsively'

# brew 'ansible'
# cask 'vagrant'
# cask 'gas-mask'
# cask 'pycharm-ce'
# cask 'sequel-pro'



# ###################################################################################################################################################
# Static generators
# ###################################################################################################################################################

brew 'hugo'



# ###################################################################################################################################################
# Traitement d'image
# ###################################################################################################################################################

# brew 'graphicsmagick'
# brew 'gsl'
# brew 'exiftool'
# brew 'imagemagick@6'
# mas 'Boxy SVG', id: 611658502
# cask 'imageoptim'
# brew 'jhead'
# brew 'webp'



# ###################################################################################################################################################
# Multimédia
# ###################################################################################################################################################

cask 'handbrake'
cask 'spotify'
cask 'iina'
cask 'phocus'
cask 'java'
cask 'jubler'
cask 'soda-player'

# cask 'vox'
# cask 'xnconvert'
# mas 'black-out', id: 1319884285
# cask 'caption'
# cask 'kap'
# brew 'ffmpeg', args: ['with-libvorbis', 'with-libvpx', 'with-openh264', 'with-theora', 'with-fdk-aac', 'with-opus', 'with-frei0r']
# cask 'licecap'



# ###################################################################################################################################################
# Communication
# ###################################################################################################################################################

cask 'skype'
cask 'whatsapp'
cask 'zoom'
mas 'LimeChat', id: 414030210
cask 'webex-meetings'
cask 'wacom-tablet'
cask 'jitsi-meet'
cask 'slack'
cask 'rocket-chat'

# cask 'discord'
# cask 'google-chat'



# ###################################################################################################################################################
# Bureautique
# ###################################################################################################################################################

cask 'libreoffice'
cask 'libreoffice-language-pack'
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
cask 'netnewswire'
brew 'tesseract'
brew 'tesseract-lang'
cask 'deepl'



# ###################################################################################################################################################
# Fonts
# ###################################################################################################################################################

cask 'font-fira-code'
cask 'font-microsoft-office'
cask 'font-source-sans-pro'
cask 'font-open-sans'
cask 'font-libre-baskerville'



# ###################################################################################################################################################
# Accessibility
# ###################################################################################################################################################

cask 'colour-contrast-analyser'
cask 'sim-daltonism'



# ###################################################################################################################################################
# Securite
# ###################################################################################################################################################

cask 'macpass'
cask 'private-internet-access'
cask 'bitwarden'
cask 'lulu'
brew 'testssl'

# brew 'gpg2'



# ###################################################################################################################################################
# Design
# ###################################################################################################################################################

cask 'craftmanager'
mas 'Pixelmator', id: 407963104
cask 'sketch'
cask 'xmind'
mas 'LittleIpsum', id: 405772121

# cask 'skala-preview'
# cask 'nudgit'
# mas 'Gravit Designer', id: 1207744923
# cask 'axure-rp'



# ###################################################################################################################################################
# SEO
# ###################################################################################################################################################

cask 'screaming-frog-seo-spider'



# ###################################################################################################################################################
# MISC
# ###################################################################################################################################################

cask 'aerial'



# ###################################################################################################################################################
# ###################################################################################################################################################
# ###################################################################################################################################################
# TO INSTALL MANUALLY
# ###################################################################################################################################################
# ###################################################################################################################################################
# ###################################################################################################################################################

# LightZone - http://lightzoneproject.org/ (cannot be added since requires login)
# Microsoft Office 2016
# Printer Canon Pixma MP495 (scan & print)
# Printer Canon IJ Scan Utility
# Printer Canon iR-ADV C2020L/2030L
# Printer Brother MFC-9465CDN
# Google Chrome
# Iconset - https://iconset.io/
