# ###################################################################################################################################################
# SETUP
# ###################################################################################################################################################

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'colindean/fonts-nonfree'
tap 'cantino/mcfly'

cask_args appdir: '/Applications' # Définir où placer les applications installées
brew 'mas' # Permettre l'installation d'applications de l'AppStore
brew 'svn' # SVN pour installer les polices


# ###################################################################################################################################################
# Outils système et réseau
# ###################################################################################################################################################

brew 'openssh'
brew 'ssh-copy-id'
brew 'openssl'
brew 'wget'
brew 'curl'
brew 'openvpn'
cask 'pritunl'

# cask 'Cyberduck'
# brew 'duck'
# cask 'ngrok'
# mas 'WireGuard', id: 1451685025
# brew 'rsync'
# cask 'airpass'
# brew 'stormssh'
# brew 'stormssh-completion'



# ###################################################################################################################################################
# Outils pour le terminal
# ###################################################################################################################################################

cask 'iterm2'
brew 'autojump'
brew 'zsh-completions'
brew 'htop'
brew 'rclone'
brew 'mcfly'
brew 'neofetch'
brew 'tmux'
brew 'asciinema'
brew 'pygments'

brew 'rich' ## cat alternative
brew 'bat' ## cat alternative
brew 'fd' ## find alternative
brew 'tldr' ## man alternative
brew 'duf' ## df alternative
brew 'diff-so-fancy' ## git diff alternative



# ###################################################################################################################################################
# Utilitaires
# ###################################################################################################################################################

# Quicklook for files without extension (README, INSTALL, Rakefile, Makefile…)
cask 'qlstephen'
cask 'webpquicklook'
cask 'qlcommonmark'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qladdict'
cask 'glance-chamburr'

cask 'keka'
cask 'adobe-acrobat-reader'
cask 'alfred'
cask 'appcleaner'
cask 'caffeine'
cask 'itsycal'
cask 'numi'
cask 'rectangle'
cask 'muzzle'
cask 'joplin'
cask 'onyx'
cask 'nextcloud'
cask 'modern-csv'

# cask 'barrier'
# cask 'balenaetcher'
# cask 'unetbootin'
# cask 'the-unarchiver'
# cask 'macdown'
# mas 'Trello', id: 1278508951
# brew 'rnr' ## A TESTER
# cask 'monitorcontrol'  ## A TESTER



# ###################################################################################################################################################
# Outils de backup et synchro
# ###################################################################################################################################################

brew 'borgbackup'
cask 'vorta'
cask 'timemachineeditor'

# brew 'restic' ## A TESTER
# brew 'borgmatic'



# ###################################################################################################################################################
# Navigateurs
# ###################################################################################################################################################

cask 'firefox'
brew 'lynx'



# ###################################################################################################################################################
# Outils de développement
# ###################################################################################################################################################

brew 'git'
cask 'sourcetree'
brew 'lazygit'
cask 'github'
cask 'docker'
cask 'lazydocker'
cask 'meld'
cask 'sublime-text'
cask 'vscodium'

# cask 'poedit'
# brew 'fzf'
# brew 'sad' # A tester pour les diff git
# brew 'git-machete'  ## A TESTER
# brew 'composer'
# brew 'wp-cli'
# cask 'gas-mask'



# ###################################################################################################################################################
# Static generators
# ###################################################################################################################################################

brew 'hugo'



# ###################################################################################################################################################
# Traitement d'image
# ###################################################################################################################################################

# brew 'graphicsmagick'
# brew 'gsl'
# brew 'exiftool'
# brew 'imagemagick'
# mas 'Boxy SVG', id: 611658502
# cask 'imageoptim'
# brew 'jhead'
# brew 'webp'



# ###################################################################################################################################################
# Multimédia
# ###################################################################################################################################################

cask 'spotify'
cask 'iina'

# cask 'jubler'
# cask 'handbrake'
# cask 'soda-player'
# cask 'vox'
# mas 'black-out', id: 1319884285
# cask 'caption'
# cask 'kap'
# brew 'ffmpeg', args: ['with-libvorbis', 'with-libvpx', 'with-openh264', 'with-theora', 'with-fdk-aac', 'with-opus', 'with-frei0r']
# cask 'licecap'



# ###################################################################################################################################################
# Communication
# ###################################################################################################################################################

cask 'whatsapp'
cask 'zoom'
cask 'signal'
cask 'rocket-chat'
cask 'microsoft-teams'
cask 'slack'
cask 'mattermost'

# cask 'skype'
# mas 'LimeChat', id: 414030210
# cask 'jitsi-meet'
# cask 'webex-meetings'
# cask 'discord'



# ###################################################################################################################################################
# Bureautique
# ###################################################################################################################################################

cask 'libreoffice'
cask 'libreoffice-language-pack'
mas 'Numbers', id: 409203825

# mas 'Keynote', id: 409183694
# mas 'Pages', id: 409201541
# cask 'deepl'
# brew 'tesseract'
# brew 'tesseract-lang'



# ###################################################################################################################################################
# Fonts
# ###################################################################################################################################################

cask 'font-fira-code'
cask 'font-microsoft-office'
cask 'font-source-sans-pro'
cask 'font-roboto'
cask 'font-open-sans'
cask 'font-libre-baskerville'
cask 'font-elstob'



# ###################################################################################################################################################
# Accessibility
# ###################################################################################################################################################

cask 'colour-contrast-analyser'
cask 'sim-daltonism'



# ###################################################################################################################################################
# Securite
# ###################################################################################################################################################

cask 'private-internet-access'
cask 'bitwarden'
cask 'lulu'
brew 'testssl'
cask 'keeper-password-manager'

# cask 'veracrypt'
# cask 'macpass'
# brew 'gpg2'



# ###################################################################################################################################################
# Design
# ###################################################################################################################################################

cask 'figma'
cask 'krita'
cask 'sketchbook'
mas 'LittleIpsum', id: 405772121
cask 'icon-shelf'
cask 'wacom-tablet'
cask 'xnconvert'

# cask 'sketch'
# cask 'craftmanager'
# cask 'xmind8'
# mas 'Pixelmator', id: 407963104



# ###################################################################################################################################################
# SEO
# ###################################################################################################################################################

cask 'screaming-frog-seo-spider'



# ###################################################################################################################################################
# MISC
# ###################################################################################################################################################

cask 'aerial'
cask 'battle-net'



# ###################################################################################################################################################
# ###################################################################################################################################################
# ###################################################################################################################################################
# TO INSTALL MANUALLY
# ###################################################################################################################################################
# ###################################################################################################################################################
# ###################################################################################################################################################

# Google Chrome
# WORK : Printer Canon iR-ADV C2020L/2030L
# WORK : Printer Brother MFC-9465CDN